// ========================== TASK 1 ==========================

// Массив скопировался в переменную shoppingCart, хатем туда пушиться бабан. Итого длинна массива fruits - 4.

// ========================== TASK 2 ==========================

let styles = ["Джаз", "Блюз"];
styles.push("Рок-н-ролл");
styles[Math.floor((styles.length - 1) / 2)] = "Классика";
console.log(styles.shift());
styles.unshift("Рэп", "Регги")

// ========================== TASK 3 ==========================

// Мы добавляем функцию в массив. Итого массив будет выглядеть так ['a', 'b', function()]
